/* Завдання 4.1
π - число “пі”. Ви можете використати Math.PI у вашому дз для вираження цього числа
Створіть змінну radius і присвойте їй числове значення радіуса кола.
Обчисліть площу кола за формулою π * radius^2 і виведіть результат.

Завдання 4.2
Створіть змінну length і присвойте їй числове значення довжини прямокутника.
Створіть змінну width і присвойте їй числове значення ширини прямокутника.
Обчисліть площу прямокутника за формулою length * width і виведіть результат.

Завдання 4.3
Створіть змінну radius і присвойте їй числове значення радіуса циліндра.
Створіть змінну height і присвойте їй числове значення висоти циліндра.
Обчисліть об'єм циліндра за формулою π * radius^2 * height і виведіть результат.

Округліть кожне отримане значення до 2 значень після крапки */

//Task 4.1
let radiusCircle = 7;
console.log("Circle area:", (Math.PI * radiusCircle ** 2).toFixed(2));

//Task 4.2
let length = 5.7;
let width = 3.9;
console.log("Rectangle area:", (length * width).toFixed(2))

//Task 4.3
let radiusCylinder = 3;
let heightCylinder = 7;
console.log("Cylinder volume:", (Math.PI * radiusCylinder ** 2 * heightCylinder).toFixed(2))